reading-notes/bollobas-combinatorics/combinatorics.tex
% Created 2022-11-29 火 18:42
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1.0in]{geometry}
\usepackage{tikz-cd}
\author{hisanobu-nakamura}
\date{}
\title{Notes on "Combinatorics" by Bollobas}
\hypersetup{
 pdfauthor={hisanobu-nakamura},
 pdftitle={Notes on "Combinatorics" by Bollobas},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Chapter 2 Representing Sets}
\label{sec:orgfeafa1d}
Theorem 1.\\
Let \(\mathcal{F}= \{A_1, A_2, \dots, A_n\}\) be a set system on \(X = [n]\).
Then there is an element \(x \in X\) such that \(A_1 - \{x\}, A_2 - \{x\}, \dots, A_n - \{x\}\) are all distinct.
The set system \(\mathcal{F}= \{\emptyset, \{1\}, \{2\}, \dots, \{n\}\}\) shows that such en \(x\) need not exist if \(|\mathcal{F}| = n +1\).

\textbf{Proof1.}

Set \(\mathcal{D} = \{D \subset X: |\mathcal{F_{D}}| \ge |D| + 1\}\), where \(\mathcal{F_{D}} = \{D \cap A_{i}: i \in \mathcal{F}\}\).
If \(A_{1}, A_{2} \in \mathcal{F}\) and \(d \in A_{1} \triangle A_{2}\) then \(\{d\} \in \mathcal{D}\) so \(\mathcal{D} \ne \emptyset\).
Let \(D\) be a maximal set in \(\mathcal{D}\). Then \(|D| \le n-2\)(??) and \(|\mathcal{F_{D}}| \le n-1\) (so, in fact \(|\mathcal{F_{D}}| = n-1\))

\fbox{What about the case $D=\{1, 2, \dots, n-1\}$ $\mathcal{F} = \{\{1\},\{2\},\dots,\{n-1\},\{n\}\}$,
where we have $|D| = n-1$ and $|\mathcal{F_{D}}| = n$?}\\

When \(D=\{1, 2, \dots, n\}\) \(\mathcal{F} = \{\{1\},\{2\},\dots,\{n-1\},\{n\}\}\),

\end{document}